function BsArea($provinceSlt,$citySlt){
	this.Items={
		"p0":[{"id":1,"name":"北京市"},
		{"id":2,"name":"天津市"},
		{"id":3,"name":"上海市"},
		{"id":4,"name":"重庆市"},
		{"id":5,"name":"河北省"},
		{"id":6,"name":"山西省"},
		{"id":7,"name":"内蒙古"},
		{"id":8,"name":"辽宁省"},
		{"id":9,"name":"吉林省"},
		{"id":10,"name":"黑龙江省"},
		{"id":11,"name":"江苏省"},
		{"id":12,"name":"浙江省"},
		{"id":13,"name":"安徽省"},
		{"id":14,"name":"福建省"},
		{"id":15,"name":"江西省"},
		{"id":16,"name":"山东省"},
		{"id":17,"name":"河南省"},
		{"id":18,"name":"湖北省"},
		{"id":19,"name":"湖南省"},
		{"id":20,"name":"广东省"},
		{"id":21,"name":"广西"},
		{"id":22,"name":"海南省"},
		{"id":23,"name":"四川省"},
		{"id":24,"name":"贵州省"},
		{"id":25,"name":"云南省"},
		{"id":26,"name":"西藏"},
		{"id":27,"name":"陕西省"},
		{"id":28,"name":"甘肃省"},
		{"id":29,"name":"青海省"},
		{"id":30,"name":"宁夏"},
		{"id":31,"name":"新疆"},
		{"id":32,"name":"香港"},
		{"id":33,"name":"澳门"},
		{"id":34,"name":"台湾省"}],
		"p1":[
		{"id":35,"name":"东城区"},
		{"id":36,"name":"西城区"},
		{"id":37,"name":"崇文区"},
		{"id":38,"name":"宣武区"},
		{"id":39,"name":"朝阳区"},
		{"id":40,"name":"丰台区"},
		{"id":41,"name":"石景山区"},
		{"id":42,"name":"海淀区"},
		{"id":43,"name":"门头沟区"},
		{"id":44,"name":"房山区"},
		{"id":45,"name":"通州区"},
		{"id":46,"name":"顺义区"},
		{"id":47,"name":"昌平区"},
		{"id":48,"name":"大兴区"},
		{"id":49,"name":"怀柔区"},
		{"id":50,"name":"平谷区"},
		{"id":51,"name":"密云县"},
		{"id":52,"name":"延庆县"},
		{"id":53,"name":"延庆镇"}],
		"p2":[
		{"id":54,"name":"和平区"},
		{"id":55,"name":"河东区"},
		{"id":56,"name":"河西区"},
		{"id":57,"name":"南开区"},
		{"id":58,"name":"河北区"},
		{"id":59,"name":"红桥区"},
		{"id":60,"name":"塘沽区"},
		{"id":61,"name":"汉沽区"},
		{"id":62,"name":"大港区"},{"id":63,"name":"东丽区"},{"id":64,"name":"西青区"},{"id":65,"name":"津南区"},{"id":66,"name":"北辰区"},{"id":67,"name":"武清区"},{"id":68,"name":"宝坻区"},{"id":69,"name":"蓟县"},{"id":70,"name":"宁河县"},{"id":71,"name":"芦台镇"},{"id":72,"name":"静海县"},{"id":73,"name":"静海镇"}],"p3":[{"id":74,"name":"黄浦区"},{"id":75,"name":"卢湾区"},{"id":76,"name":"徐汇区"},{"id":77,"name":"长宁区"},{"id":78,"name":"静安区"},{"id":79,"name":"普陀区"},{"id":80,"name":"闸北区"},{"id":81,"name":"虹口区"},{"id":82,"name":"杨浦区"},{"id":83,"name":"闵行区"},{"id":84,"name":"宝山区"},{"id":85,"name":"嘉定区"},{"id":86,"name":"浦东新区"},{"id":87,"name":"金山区"},{"id":88,"name":"松江区"},{"id":89,"name":"青浦区"},{"id":90,"name":"南汇区"},{"id":91,"name":"奉贤区"},{"id":92,"name":"崇明县"},{"id":93,"name":"城桥镇"}],"p4":[{"id":94,"name":"渝中区"},{"id":95,"name":"大渡口区"},{"id":96,"name":"江北区"},{"id":97,"name":"沙坪坝区"},{"id":98,"name":"九龙坡区"},{"id":99,"name":"南岸区"},{"id":100,"name":"北碚区"},{"id":101,"name":"万盛区"},{"id":102,"name":"双桥区"},{"id":103,"name":"渝北区"},{"id":104,"name":"巴南区"},{"id":105,"name":"万州区"},{"id":106,"name":"涪陵区"},{"id":107,"name":"黔江区"},{"id":108,"name":"长寿区"},{"id":109,"name":"合川市"},{"id":110,"name":"永川区市"},{"id":111,"name":"江津市"},{"id":112,"name":"南川市"},{"id":113,"name":"綦江县"},{"id":114,"name":"潼南县"},{"id":115,"name":"铜梁县"},{"id":116,"name":"大足县"},{"id":117,"name":"荣昌县"},{"id":118,"name":"璧山县"},{"id":119,"name":"垫江县"},{"id":120,"name":"武隆县"},{"id":121,"name":"丰都县"},{"id":122,"name":"城口县"},{"id":123,"name":"梁平县"},{"id":124,"name":"开县"},{"id":125,"name":"巫溪县"},{"id":126,"name":"巫山县"},{"id":127,"name":"奉节县"},{"id":128,"name":"云阳县"},{"id":129,"name":"忠县"},{"id":130,"name":"石柱土家族自治县"},{"id":131,"name":"彭水苗族土家族自治县"},{"id":132,"name":"酉阳土家族苗族自治县"},{"id":133,"name":"秀山土家族苗族自治县"}],"p5":[{"id":134,"name":"石家庄市"},{"id":135,"name":"张家口市"},{"id":136,"name":"承德市"},{"id":137,"name":"秦皇岛市"},{"id":138,"name":"唐山市"},{"id":139,"name":"廊坊市"},{"id":140,"name":"保定市"},{"id":141,"name":"衡水市"},{"id":142,"name":"沧州市"},{"id":143,"name":"邢台市"},{"id":144,"name":"邯郸市"}],"p6":[{"id":145,"name":"太原市"},{"id":146,"name":"朔州市"},{"id":147,"name":"大同市"},{"id":148,"name":"阳泉市"},{"id":149,"name":"长治市"},{"id":150,"name":"晋城市"},{"id":151,"name":"忻州市"},{"id":152,"name":"晋中市"},{"id":153,"name":"临汾市"},{"id":154,"name":"吕梁市"},{"id":155,"name":"运城市"}],"p7":[{"id":156,"name":"呼和浩特市"},{"id":157,"name":"包头市"},{"id":158,"name":"乌海市"},{"id":159,"name":"赤峰市"},{"id":160,"name":"通辽市"},{"id":161,"name":"呼伦贝尔市"},{"id":162,"name":"鄂尔多斯市"},{"id":163,"name":"乌兰察布市"},{"id":164,"name":"巴彦淖尔市"},{"id":165,"name":"兴安盟"},{"id":166,"name":"锡林郭勒盟"},{"id":167,"name":"阿拉善盟"}],"p8":[{"id":168,"name":"沈阳市"},{"id":169,"name":"朝阳市"},{"id":170,"name":"阜新市"},{"id":171,"name":"铁岭市"},{"id":172,"name":"抚顺市"},{"id":173,"name":"本溪市"},{"id":174,"name":"辽阳市"},{"id":175,"name":"鞍山市"},{"id":176,"name":"丹东市"},{"id":177,"name":"大连市"},{"id":178,"name":"营口市"},{"id":179,"name":"盘锦市"},{"id":180,"name":"锦州市"},{"id":181,"name":"葫芦岛市"}],"p9":[{"id":182,"name":"长春市"},{"id":183,"name":"白城市"},{"id":184,"name":"松原市"},{"id":185,"name":"吉林市"},{"id":186,"name":"四平市"},{"id":187,"name":"辽源市"},{"id":188,"name":"通化市"},{"id":189,"name":"白山市"},{"id":190,"name":"延边州"}],"p10":[{"id":191,"name":"哈尔滨市"},{"id":192,"name":"齐齐哈尔市"},{"id":193,"name":"七台河市"},{"id":194,"name":"黑河市"},{"id":195,"name":"大庆市"},{"id":196,"name":"鹤岗市"},{"id":197,"name":"伊春市"},{"id":198,"name":"佳木斯市"},{"id":199,"name":"双鸭山市"},{"id":200,"name":"鸡西市"},{"id":201,"name":"牡丹江市"},{"id":202,"name":"绥化市"},{"id":203,"name":"大兴安岭地区"}],"p11":[{"id":204,"name":"南京市"},{"id":205,"name":"徐州市"},{"id":206,"name":"连云港市"},{"id":207,"name":"宿迁市"},{"id":208,"name":"淮安市"},{"id":209,"name":"盐城市"},{"id":210,"name":"扬州市"},{"id":211,"name":"泰州市"},{"id":212,"name":"南通市"},{"id":213,"name":"镇江市"},{"id":214,"name":"常州市"},{"id":215,"name":"无锡市"},{"id":216,"name":"苏州市"}],"p12":[{"id":217,"name":"杭州市"},{"id":218,"name":"湖州市"},{"id":219,"name":"嘉兴市"},{"id":220,"name":"舟山市"},{"id":221,"name":"宁波市"},{"id":222,"name":"绍兴市"},{"id":223,"name":"衢州市"},{"id":224,"name":"金华市"},{"id":225,"name":"台州市"},{"id":226,"name":"温州市"},{"id":227,"name":"丽水市"}],"p13":[{"id":228,"name":"合肥市"},{"id":229,"name":"宿州市"},{"id":230,"name":"淮北市"},{"id":231,"name":"亳州市"},{"id":232,"name":"阜阳市"},{"id":233,"name":"蚌埠市"},{"id":234,"name":"淮南市"},{"id":235,"name":"滁州市"},{"id":236,"name":"马鞍山市"},{"id":237,"name":"芜湖市"},{"id":238,"name":"铜陵市"},{"id":239,"name":"安庆市"},{"id":240,"name":"黄山市"},{"id":241,"name":"六安市"},{"id":242,"name":"巢湖市"},{"id":243,"name":"池州市"},{"id":244,"name":"宣城市"}],"p14":[{"id":245,"name":"福州市"},{"id":246,"name":"南平市"},{"id":247,"name":"莆田市"},{"id":248,"name":"三明市"},{"id":249,"name":"泉州市"},{"id":250,"name":"厦门市"},{"id":251,"name":"漳州市"},{"id":252,"name":"龙岩市"},{"id":253,"name":"宁德市"}],"p15":[{"id":254,"name":"南昌市"},{"id":255,"name":"九江市"},{"id":256,"name":"景德镇市"},{"id":257,"name":"鹰潭市"},{"id":258,"name":"新余市"},{"id":259,"name":"萍乡市"},{"id":260,"name":"赣州市"},{"id":261,"name":"上饶市"},{"id":262,"name":"抚州市"},{"id":263,"name":"宜春市"},{"id":264,"name":"吉安市"}],"p16":[{"id":265,"name":"济南市"},{"id":266,"name":"青岛市"},{"id":267,"name":"聊城市"},{"id":268,"name":"德州市"},{"id":269,"name":"东营市"},{"id":270,"name":"淄博市"},{"id":271,"name":"潍坊市"},{"id":272,"name":"烟台市"},{"id":273,"name":"威海市"},{"id":274,"name":"日照市"},{"id":275,"name":"临沂市"},{"id":276,"name":"枣庄市"},{"id":277,"name":"济宁市"},{"id":278,"name":"泰安市"},{"id":279,"name":"莱芜市"},{"id":280,"name":"滨州市"},{"id":281,"name":"菏泽市"}],"p17":[{"id":282,"name":"郑州市"},{"id":283,"name":"开封市"},{"id":284,"name":"三门峡市"},{"id":285,"name":"洛阳市"},{"id":286,"name":"焦作市"},{"id":287,"name":"新乡市"},{"id":288,"name":"鹤壁市"},{"id":289,"name":"安阳市"},{"id":290,"name":"濮阳市"},{"id":291,"name":"商丘市"},{"id":292,"name":"许昌市"},{"id":293,"name":"漯河市"},{"id":294,"name":"平顶山市"},{"id":295,"name":"南阳市"},{"id":296,"name":"信阳市"},{"id":297,"name":"周口市"},{"id":298,"name":"驻马店市"},{"id":299,"name":"济源市"}],"p18":[{"id":300,"name":"武汉市"},{"id":301,"name":"十堰市"},{"id":302,"name":"襄樊市"},{"id":303,"name":"荆门市"},{"id":304,"name":"孝感市"},{"id":305,"name":"黄冈市"},{"id":306,"name":"鄂州市"},{"id":307,"name":"黄石市"},{"id":308,"name":"咸宁市"},{"id":309,"name":"荆州市"},{"id":310,"name":"宜昌市"},{"id":311,"name":"随州市"},{"id":312,"name":"省直辖县级行政单位"},{"id":313,"name":"恩施州"}],"p19":[{"id":314,"name":"长沙市"},{"id":315,"name":"张家界市"},{"id":316,"name":"常德市"},{"id":317,"name":"益阳市"},{"id":318,"name":"岳阳市"},{"id":319,"name":"株洲市"},{"id":320,"name":"湘潭市"},{"id":321,"name":"衡阳市"},{"id":322,"name":"郴州市"},{"id":323,"name":"永州市"},{"id":324,"name":"邵阳市"},{"id":325,"name":"怀化市"},{"id":326,"name":"娄底市"},{"id":327,"name":"湘西州"}],"p20":[{"id":328,"name":"广州市"},{"id":329,"name":"深圳市"},{"id":330,"name":"清远市"},{"id":331,"name":"韶关市"},{"id":332,"name":"河源市"},{"id":333,"name":"梅州市"},{"id":334,"name":"潮州市"},{"id":335,"name":"汕头市"},{"id":336,"name":"揭阳市"},{"id":337,"name":"汕尾市"},{"id":338,"name":"惠州市"},{"id":339,"name":"东莞市"},{"id":340,"name":"珠海市"},{"id":341,"name":"中山市"},{"id":342,"name":"江门市"},{"id":343,"name":"佛山市"},{"id":344,"name":"肇庆市"},{"id":345,"name":"云浮市"},{"id":346,"name":"阳江市"},{"id":347,"name":"茂名市"},{"id":348,"name":"湛江市"}],"p21":[{"id":349,"name":"南宁市"},{"id":350,"name":"桂林市"},{"id":351,"name":"柳州市"},{"id":352,"name":"梧州市"},{"id":353,"name":"贵港市"},{"id":354,"name":"玉林市"},{"id":355,"name":"钦州市"},{"id":356,"name":"北海市"},{"id":357,"name":"防城港市"},{"id":358,"name":"崇左市"},{"id":359,"name":"百色市"},{"id":360,"name":"河池市"},{"id":361,"name":"来宾市"},{"id":362,"name":"贺州市"}],"p22":[{"id":363,"name":"海口市"},{"id":364,"name":"三亚市"},{"id":365,"name":"省直辖行政单位"}],"p23":[{"id":366,"name":"成都市"},{"id":367,"name":"广元市"},{"id":368,"name":"绵阳市"},{"id":369,"name":"德阳市"},{"id":370,"name":"南充市"},{"id":371,"name":"广安市"},{"id":372,"name":"遂宁市"},{"id":373,"name":"内江市"},{"id":374,"name":"乐山市"},{"id":375,"name":"自贡市"},{"id":376,"name":"泸州市"},{"id":377,"name":"宜宾市"},{"id":378,"name":"攀枝花市"},{"id":379,"name":"巴中市"},{"id":380,"name":"达州市"},{"id":381,"name":"资阳市"},{"id":382,"name":"眉山市"},{"id":383,"name":"雅安市"},{"id":384,"name":"阿坝州"},{"id":385,"name":"甘孜州"},{"id":386,"name":"凉山州"}],"p24":[{"id":387,"name":"贵阳市"},{"id":388,"name":"六盘水市"},{"id":389,"name":"遵义市"},{"id":390,"name":"安顺市"},{"id":391,"name":"毕节地区"},{"id":392,"name":"铜仁地区"},{"id":393,"name":"黔东南州"},{"id":394,"name":"黔南州"},{"id":395,"name":"黔西南州"}],"p25":[{"id":396,"name":"昆明市"},{"id":397,"name":"曲靖市"},{"id":398,"name":"玉溪市"},{"id":399,"name":"保山市"},{"id":400,"name":"昭通市"},{"id":401,"name":"丽江市"},{"id":402,"name":"思茅市"},{"id":403,"name":"临沧市"},{"id":404,"name":"德宏州"},{"id":405,"name":"怒江州"},{"id":406,"name":"迪庆州"},{"id":407,"name":"大理州"},{"id":408,"name":"楚雄州"},{"id":409,"name":"红河州"},{"id":410,"name":"文山州"},{"id":411,"name":"西双版纳州"}],"p26":[{"id":412,"name":"拉萨市"},{"id":413,"name":"那曲地区"},{"id":414,"name":"昌都地区"},{"id":415,"name":"林芝地区"},{"id":416,"name":"山南地区"},{"id":417,"name":"日喀则地区"},{"id":418,"name":"阿里地区"}],"p27":[{"id":419,"name":"西安市"},{"id":420,"name":"延安市"},{"id":421,"name":"铜川市"},{"id":422,"name":"渭南市"},{"id":423,"name":"咸阳市"},{"id":424,"name":"宝鸡市"},{"id":425,"name":"汉中市"},{"id":426,"name":"榆林市"},{"id":427,"name":"安康市"},{"id":428,"name":"商洛市"}],"p28":[{"id":429,"name":"兰州市"},{"id":430,"name":"嘉峪关市"},{"id":431,"name":"白银市"},{"id":432,"name":"天水市"},{"id":433,"name":"武威市"},{"id":434,"name":"酒泉市"},{"id":435,"name":"张掖市"},{"id":436,"name":"庆阳市"},{"id":437,"name":"平凉市"},{"id":438,"name":"定西市"},{"id":439,"name":"陇南市"},{"id":440,"name":"临夏州"},{"id":441,"name":"甘南州"}],"p29":[{"id":442,"name":"西宁市"},{"id":443,"name":"海东地区"},{"id":444,"name":"海北州"},{"id":445,"name":"海南州"},{"id":446,"name":"黄南州"},{"id":447,"name":"果洛州"},{"id":448,"name":"玉树州"},{"id":449,"name":"海西州"}],"p30":[{"id":450,"name":"银川市"},{"id":451,"name":"石嘴山市"},{"id":452,"name":"吴忠市"},{"id":453,"name":"固原市"},{"id":454,"name":"中卫市"}],"p31":[{"id":455,"name":"乌鲁木齐市"},{"id":456,"name":"克拉玛依市"},{"id":457,"name":"自治区直辖县级行政单位"},{"id":458,"name":"喀什地区"},{"id":459,"name":"阿克苏地区"},{"id":460,"name":"和田地区"},{"id":461,"name":"吐鲁番地区"},{"id":462,"name":"哈密地区"},{"id":463,"name":"克孜勒苏柯州"},{"id":464,"name":"博尔塔拉州"},{"id":465,"name":"昌吉州"},{"id":466,"name":"巴音郭楞州"},{"id":467,"name":"伊犁州"},{"id":468,"name":"塔城地区"},{"id":469,"name":"阿勒泰地区"}],"p32":[{"id":470,"name":"香港特别行政区"}],"p33":[{"id":471,"name":"澳门特别行政区"}],"p34":[{"id":472,"name":"台北"},{"id":473,"name":"高雄"},{"id":474,"name":"台中"},{"id":475,"name":"花莲"},{"id":476,"name":"基隆"},{"id":477,"name":"嘉义"},{"id":478,"name":"金门"},{"id":479,"name":"连江"},{"id":480,"name":"苗栗"},{"id":481,"name":"南投"},{"id":482,"name":"澎湖"},{"id":483,"name":"屏东"},{"id":484,"name":"台东"},{"id":485,"name":"台南"},{"id":486,"name":"桃园"},{"id":487,"name":"新竹"},{"id":488,"name":"宜兰"},{"id":489,"name":"云林"},{"id":490,"name":"彰化"}]};
	var _this=this;
	var isInit=true;
	var province=function (defaultValue) {
		$.each(_this.Items.p0,function(index, el) {
			$provinceSlt.append('<option value='+el.id+'>'+el.name+'</option>');
		});
		$provinceSlt.val(defaultValue);
	}
	var city=function (pid,defaultValue) {
		$citySlt.find('option').remove();
		$.each(_this.Items['p'+pid],function(index, el) {
			$citySlt.append('<option value='+el.id+'>'+el.name+'</option>');
		});
		if(isInit){
			if(defaultValue){
				$citySlt.val(defaultValue);
			}
			isInit=false;
		}
	}
	province($provinceSlt.attr('did'));//执行
	$provinceSlt.change(function() {
		city($(this).val(),false);
	}).change();
}